espruino/Espruino/targetlibs/nrf5x/components/nfc/t2t_parser/nfc_t2t_parser.c
    p_type_2_tag->lock_bytes              = uint16_big_decode(&p_raw_data[10]);

    if (!type_2_tag_is_bcc_correct(&p_type_2_tag->sn))
    {
        NRF_LOG_WARNING("Warning! BCC of the serial number is not correct!\r\n");
    }

    return NRF_SUCCESS;
}


/**
 * @brief Function for parsing a Capabiliy Container area of a Type 2 Tag.
 *
 * This function reads data from a Capability Container area in the raw data buffer and fills the
 * @ref type_2_tag_capability_container_t structure within @ref type_2_tag_t.
 *
 * @param[in,out] p_type_2_tag Pointer to the structure that will be filled with parsed data.
 * @param[in]     p_raw_data   Pointer to the buffer with raw data from the tag.
 *
 * @retval        NRF_SUCCESS  If the parsing operation of the Capability Container succeeded.
 *                             Otherwise, an error code is returned.
 *
 */
static ret_code_t type_2_tag_cc_parse(type_2_tag_t * p_type_2_tag, uint8_t * p_raw_data)
{
    uint8_t * p_cc_block = p_raw_data + T2T_CC_BLOCK_OFFSET;

    if (p_cc_block[0] != T2T_NFC_FORUM_DEFINED_DATA)
    {
        return NRF_ERROR_INVALID_DATA;
    }

    p_type_2_tag->cc.major_version  = MSN_GET(p_cc_block[1]);
    p_type_2_tag->cc.minor_version  = LSN_GET(p_cc_block[1]);
    p_type_2_tag->cc.data_area_size = p_cc_block[2] * 8;
    p_type_2_tag->cc.read_access    = MSN_GET(p_cc_block[3]);
    p_type_2_tag->cc.write_access   = LSN_GET(p_cc_block[3]);

    return NRF_SUCCESS;
}


/**
 * @brief Function for parsing a single TLV block.
 *
 * This function reads a single TLV block from the raw data buffer, from the position indicated by
 * the p_tlv_offset, and adds it to the @ref type_2_tag_t structure.
 *
 * @param[in,out] p_type_2_tag Pointer to the structure that will be filled with parsed data.
 * @param[in]     p_raw_data   Pointer to the buffer with raw data from the tag.
 * @param[in,out] p_tlv_offset As input: offset of the TLV block to parse. As output: offset of the
 *                             next TLV block, 0 if it was the last block.
 *
 * @retval        NRF_SUCCESS  If the parsing operation of the block succeeded. Otherwise, an error
 *                             code is returned.
 *
 */
static ret_code_t type_2_tag_tlv_parse(type_2_tag_t * p_type_2_tag,
                                       uint8_t      * p_raw_data,
                                       uint16_t     * p_tlv_offset)
{
    ret_code_t err_code;
    tlv_block_t new_block;

    // Get tag field.
    err_code = type_2_tag_tlv_block_extract(p_type_2_tag, p_raw_data, p_tlv_offset, &new_block);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    if (!tlv_block_is_data_length_correct(&new_block))
    {
        return NRF_ERROR_INVALID_DATA;
    }

    // Further action depends on tag type.
    switch (new_block.tag)
    {
        case TLV_NULL:
        case TLV_TERMINATOR:
            // Ignore them.
            break;

        case TLV_LOCK_CONTROL:
        case TLV_MEMORY_CONTROL:
        case TLV_NDEF_MESSAGE:
        case TLV_PROPRIETARY:
        default:
            // Unknown tag types are also added.
            err_code = type_2_tag_tlv_block_insert(p_type_2_tag, &new_block);
            if (err_code != NRF_SUCCESS)
            {
                NRF_LOG_WARNING("Warning! Not enough memory  to insert all of the blocks!\r\n");
                return err_code;
            }
            break;
    }

    return NRF_SUCCESS;
}


void type_2_tag_clear(type_2_tag_t * p_type_2_tag)
{
    p_type_2_tag->tlv_count = 0;
    memset(&p_type_2_tag->cc, 0, sizeof(p_type_2_tag->cc));
    memset(&p_type_2_tag->sn, 0, sizeof(p_type_2_tag->sn));
}


ret_code_t type_2_tag_parse(type_2_tag_t * p_type_2_tag, uint8_t * p_raw_data)
{
    ret_code_t err_code;

    type_2_tag_clear(p_type_2_tag);

    err_code = type_2_tag_internal_parse(p_type_2_tag, p_raw_data);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    err_code = type_2_tag_cc_parse(p_type_2_tag, p_raw_data);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    if (!type_2_tag_is_version_supported(p_type_2_tag))
    {
        return NRF_ERROR_NOT_SUPPORTED;
    }

    uint16_t offset = T2T_FIRST_DATA_BLOCK_OFFSET;

    while (offset > 0)
    {
        // Check if end of tag is reached (no terminator block was present).
        if (type_2_tag_is_end_reached(p_type_2_tag, offset))
        {
            NRF_LOG_DEBUG("No terminator block was found in the tag!\r\n");
            break;
        }

        err_code = type_2_tag_tlv_parse(p_type_2_tag, p_raw_data, &offset);
        if (err_code != NRF_SUCCESS)
        {
            return err_code;
        }
    }

    return NRF_SUCCESS;
}


void type_2_tag_printout(type_2_tag_t * p_type_2_tag)
{
    uint32_t i;
    NRF_LOG_INFO("Type 2 Tag contents:\r\n\r\n");
    NRF_LOG_INFO("Number of TLV blocks: %d\r\n\r\n", p_type_2_tag->tlv_count);

    NRF_LOG_INFO("Internal data:\r\n");
    NRF_LOG_INFO("    Manufacturer ID:      0x%02x\r\n",  p_type_2_tag->sn.manufacturer_id);
    NRF_LOG_INFO("    Serial number part 1: 0x%04x\r\n",  p_type_2_tag->sn.serial_number_part_1);
    NRF_LOG_INFO("    Check byte 0:         0x%02x\r\n",  p_type_2_tag->sn.check_byte_0);
    NRF_LOG_INFO("    Serial number part 2: 0x%08lx\r\n", p_type_2_tag->sn.serial_number_part_2);
    NRF_LOG_INFO("    Check byte 1:         0x%02x\r\n",  p_type_2_tag->sn.check_byte_1);
    NRF_LOG_INFO("    Internal byte:        0x%02x\r\n",  p_type_2_tag->sn.internal);
    NRF_LOG_INFO("    Lock bytes:           0x%04x\r\n\r\n",  p_type_2_tag->lock_bytes);

    NRF_LOG_INFO("Capability Container data:\r\n");
    NRF_LOG_INFO("    Major version number: %d\r\n", p_type_2_tag->cc.major_version);
    NRF_LOG_INFO("    Minor version number: %d\r\n", p_type_2_tag->cc.minor_version);
    NRF_LOG_INFO("    Data area size:       %d\r\n", p_type_2_tag->cc.data_area_size);
    NRF_LOG_INFO("    Read access:          0x%02X\r\n", p_type_2_tag->cc.read_access);
    NRF_LOG_INFO("    Write access:         0x%02X\r\n\r\n", p_type_2_tag->cc.write_access);

    for (i = 0; i < p_type_2_tag->tlv_count; i++)
    {
        NRF_LOG_INFO("TLV block 0x%02X: \r\n", p_type_2_tag->p_tlv_block_array[i].tag);
        switch (p_type_2_tag->p_tlv_block_array[i].tag)
        {
            case TLV_LOCK_CONTROL:
                NRF_LOG_INFO("Lock Control\r\n\r\n");
               break;
            case TLV_MEMORY_CONTROL:
                NRF_LOG_INFO("Memory Control\r\n\r\n");
               break;
            case TLV_NDEF_MESSAGE:
                NRF_LOG_INFO("NDEF Message\r\n\r\n");
               break;
            case TLV_PROPRIETARY:
                NRF_LOG_INFO("Proprietary\r\n\r\n");
               break;
            case TLV_NULL:
                NRF_LOG_INFO("Null\r\n\r\n");
               break;
            case TLV_TERMINATOR:
                NRF_LOG_INFO("Terminator\r\n\r\n");
               break;
            default:
                NRF_LOG_INFO("Unknown\r\n\r\n");
               break;
        }

        NRF_LOG_INFO("    Length: %d\r\n", p_type_2_tag->p_tlv_block_array[i].length);

        if (p_type_2_tag->p_tlv_block_array[i].length > 0)
        {
            NRF_LOG_INFO("    Data:\r\n");
            NRF_LOG_HEXDUMP_INFO(p_type_2_tag->p_tlv_block_array[i].p_value,
                                 p_type_2_tag->p_tlv_block_array[i].length);
        }
        NRF_LOG_INFO("\r\n\r\n");
    }
}

#endif // NFC_T2T_PARSER_ENABLED
